<a href="https://colab.research.google.com/github/dubba1212/AIML/blob/master/DAY_18(15_06_2020).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

###Steps involved in data pre-processing:
1. importing Libraries
2. importing the dataset
3. missing values
4. categorical data
5. spitting data
6. Feature scaling

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sklearn

In [53]:
#importing the dataset
data = pd.read_table("http://bit.ly/movieusers")
data.head(3)

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537

In [54]:
data = pd.read_table("http://bit.ly/movieusers",sep="|")
data.head(2)

   1  24  M technician  85711
0  2  53  F      other  94043
1  3  23  M     writer  32067

In [55]:
data = pd.read_table("http://bit.ly/movieusers",sep="|",header=None)
data.head(2)

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043

###Handling missing values

In [56]:
df = pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [57]:
df.day.dtype

dtype('O')

In [58]:
type(df.day[0])

str

In [59]:
df['temperature'].value_counts()#mode

-99999    2
 32       2
 31       1
 28       1
 34       1
Name: temperature, dtype: int64

In [60]:
#return the frequency of the column values
df['temperature'].value_counts()

-99999    2
 32       2
 31       1
 28       1
 34       1
Name: temperature, dtype: int64

In [61]:
df[df.duplicated()]

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [62]:
#checking duplicated data for specific column
df[df['temperature'].duplicated()]

        day  temperature  windspeed event
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -99999  Rain

In [63]:
df[df['event'].duplicated()]

        day  temperature  windspeed  event
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [64]:
df['event'].value_counts()

Sunny    2
Rain     2
0        2
Snow     1
Name: event, dtype: int64

In [65]:
df = pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv",parse_dates=['day'])
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02       -99999          7  Sunny
2 2017-01-03           28     -99999   Snow
3 2017-01-04       -99999          7      0
4 2017-01-05           32     -99999   Rain
5 2017-01-06           31          2  Sunny
6 2017-01-06           34          5      0

In [66]:
df.day.dtype

dtype('<M8[ns]')

In [67]:
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

In [68]:
new_df = df.replace({'temperature': -99999,'windspeed': -99999,'event': '0'},np.nan)
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [69]:
data = new_df.fillna(0)
data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

###imputation: imputation is a process of substituting the missing values

In [70]:
new_df.isnull().sum()

day            0
temperature    2
windspeed      2
event          2
dtype: int64

In [71]:
new_df.fillna(method = 'ffill') #forward fill

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0   Snow
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny

In [72]:
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [73]:
f_data = new_df.fillna(method='ffill') 
f_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0   Snow
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny

In [74]:
##bfill--backfill
b_data = new_df.fillna(method='ffill')
b_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0   Snow
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny

In [75]:
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

In [76]:
mean_data = new_df.fillna(new_df.mean()) #fill the missing values in a column's mean values
mean_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         31.4        7.0  Sunny
2 2017-01-03         28.0        5.4   Snow
3 2017-01-04         31.4        7.0    NaN
4 2017-01-05         32.0        5.4   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [77]:
new_df.median()

temperature    32.0
windspeed       6.0
dtype: float64

In [78]:
#median imputation
median_data = new_df.fillna(new_df.median())
median_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        6.0   Snow
3 2017-01-04         32.0        7.0    NaN
4 2017-01-05         32.0        6.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [80]:
new_df.event.mode().iloc[1]

'Sunny'

In [82]:
new_df['event'] = new_df['event'].fillna(new_df.event.mode().iloc[0])
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0   Rain
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0   Rain

###Pratice Question 
[[19,7,19,93],--->dd mm cc yy

[94,18,4,22],-->yy+1 cc-1 mm-3 dd+3

[5,21,95,17],-->mm-2 dd+2 yy+2 cc-2
 
 [20,92,20,6]])-->cc+1 yy-1 dd+1 mm-1
 
- sum of columns is 138
- sum of rows is 138
- sum of both forward and backword daigonal elements sum is 138
- sum of middle square is 138
- sum of all 4 squares is 138
- sum of corner elemnts sum is 138

In [0]:
import numpy as np
arr1 = np.array([[19,7,19,93],
                 [94,18,4,22],
                 [5,21,95,17],
                 [20,92,20,6]])

In [84]:
#sum of columns is 138
arr1.sum(axis=1)

array([138, 138, 138, 138])

In [85]:
#sum of rouws is 138
arr1.sum(axis=0)

array([138, 138, 138, 138])

In [96]:
#forward diagonal sum
arr1.trace(axis1=1,axis2=0)

138

In [97]:
arr1.trace(axis1=0,axis2=1)

138

In [98]:
#sum of middle square is 138
s=0
for i in range(4):
  for j in range(4):
    if(i!=0 and j!=0 and i!=3 and j!=3):

      s+=arr1[i,j]
s

138

In [99]:
#sum of corner elemnts sum is 138
arr1[0,0]+arr1[0,3]+arr1[3,0]+arr1[3,3]

138

In [100]:
f=0
b=0
for i in range(4):
  for j in range(4):
    if i==j:
      f+=arr1[i,j]
    if i+j ==3:
      b += arr1[i,j]
print(f)
print(b)

138
138